In [10]:
import pandas as pd

In [11]:
df = pd.read_csv('data/attendance.csv', index_col=0)
df

         야구     축구      배구  남자농구  여자농구
연도
2008  10881  11642  1253.0  4208  1329
2009  11562  10983  1471.0  4152  1206
2010  11402  12873     NaN  3870   705
2011  13055  10709  1774.0  3955  1445
2012  13747   7157     NaN  4537  1150
2013  11373   7656     NaN  4092  1237
2014  11429   8115  1967.0  4458  1417
2015  10357   7720  2311.0  3953  1480
2016  11583   7854  2336.0  3543  1425
2017  11668   6502  2425.0  3188  1097

In [12]:
# 결측값이 있는 위차만 True
df.isnull()

         야구     축구     배구   남자농구   여자농구
연도
2008  False  False  False  False  False
2009  False  False  False  False  False
2010  False  False   True  False  False
2011  False  False  False  False  False
2012  False  False   True  False  False
2013  False  False   True  False  False
2014  False  False  False  False  False
2015  False  False  False  False  False
2016  False  False  False  False  False
2017  False  False  False  False  False

In [13]:
df.isnull().sum()

야구      0
축구      0
배구      3
남자농구    0
여자농구    0
dtype: int64

## 결측값 해결방법

### 1. 그대로 두기
### 2. 결측값 레코드 지우기 dropna()

In [14]:
# 결측값 레코드 지우기
df.dropna()

         야구     축구      배구  남자농구  여자농구
연도
2008  10881  11642  1253.0  4208  1329
2009  11562  10983  1471.0  4152  1206
2011  13055  10709  1774.0  3955  1445
2014  11429   8115  1967.0  4458  1417
2015  10357   7720  2311.0  3953  1480
2016  11583   7854  2336.0  3543  1425
2017  11668   6502  2425.0  3188  1097

In [15]:
df.dropna(inplace=True)
df

         야구     축구      배구  남자농구  여자농구
연도
2008  10881  11642  1253.0  4208  1329
2009  11562  10983  1471.0  4152  1206
2011  13055  10709  1774.0  3955  1445
2014  11429   8115  1967.0  4458  1417
2015  10357   7720  2311.0  3953  1480
2016  11583   7854  2336.0  3543  1425
2017  11668   6502  2425.0  3188  1097

기존데이터에서 2010, 2012, 2013년 데이터가 완전히 사라진다.

## 결측값이 많은 컬럼의 데이터만 포기하기

### df.dropna(axis='columns')

In [26]:
df = pd.read_csv('data/attendance.csv', index_col=0)
df

         야구     축구      배구  남자농구  여자농구
연도
2008  10881  11642  1253.0  4208  1329
2009  11562  10983  1471.0  4152  1206
2010  11402  12873     NaN  3870   705
2011  13055  10709  1774.0  3955  1445
2012  13747   7157     NaN  4537  1150
2013  11373   7656     NaN  4092  1237
2014  11429   8115  1967.0  4458  1417
2015  10357   7720  2311.0  3953  1480
2016  11583   7854  2336.0  3543  1425
2017  11668   6502  2425.0  3188  1097

In [27]:
df.dropna(axis=1)

         야구     축구  남자농구  여자농구
연도
2008  10881  11642  4208  1329
2009  11562  10983  4152  1206
2010  11402  12873  3870   705
2011  13055  10709  3955  1445
2012  13747   7157  4537  1150
2013  11373   7656  4092  1237
2014  11429   8115  4458  1417
2015  10357   7720  3953  1480
2016  11583   7854  3543  1425
2017  11668   6502  3188  1097

In [17]:
df.dropna(axis='columns')

         야구     축구  남자농구  여자농구
연도
2008  10881  11642  4208  1329
2009  11562  10983  4152  1206
2010  11402  12873  3870   705
2011  13055  10709  3955  1445
2012  13747   7157  4537  1150
2013  11373   7656  4092  1237
2014  11429   8115  4458  1417
2015  10357   7720  3953  1480
2016  11583   7854  3543  1425
2017  11668   6502  3188  1097

결측값이 있던 배구 컬럼이 사라졌다.

## 현재 가진 데이터를 보존하기 : 결측값 대체하기

### 1. df.fillna(0) : 0으로 채우기
### 2. df.fillna(df.mean()) : 평균으로 채우기
### 3. df.fillna(df.median()) : 중앙값으로 채우기


기존 데이터를 변경하려면 inplace=True

In [18]:
df.fillna(0)

         야구     축구      배구  남자농구  여자농구
연도
2008  10881  11642  1253.0  4208  1329
2009  11562  10983  1471.0  4152  1206
2010  11402  12873     0.0  3870   705
2011  13055  10709  1774.0  3955  1445
2012  13747   7157     0.0  4537  1150
2013  11373   7656     0.0  4092  1237
2014  11429   8115  1967.0  4458  1417
2015  10357   7720  2311.0  3953  1480
2016  11583   7854  2336.0  3543  1425
2017  11668   6502  2425.0  3188  1097

In [19]:
df.fillna(df.mean())

         야구     축구           배구  남자농구  여자농구
연도
2008  10881  11642  1253.000000  4208  1329
2009  11562  10983  1471.000000  4152  1206
2010  11402  12873  1933.857143  3870   705
2011  13055  10709  1774.000000  3955  1445
2012  13747   7157  1933.857143  4537  1150
2013  11373   7656  1933.857143  4092  1237
2014  11429   8115  1967.000000  4458  1417
2015  10357   7720  2311.000000  3953  1480
2016  11583   7854  2336.000000  3543  1425
2017  11668   6502  2425.000000  3188  1097

In [20]:
df.fillna(df.median())

         야구     축구      배구  남자농구  여자농구
연도
2008  10881  11642  1253.0  4208  1329
2009  11562  10983  1471.0  4152  1206
2010  11402  12873  1967.0  3870   705
2011  13055  10709  1774.0  3955  1445
2012  13747   7157  1967.0  4537  1150
2013  11373   7656  1967.0  4092  1237
2014  11429   8115  1967.0  4458  1417
2015  10357   7720  2311.0  3953  1480
2016  11583   7854  2336.0  3543  1425
2017  11668   6502  2425.0  3188  1097

In [21]:
df.fillna(df.median(), inplace=True)
df

         야구     축구      배구  남자농구  여자농구
연도
2008  10881  11642  1253.0  4208  1329
2009  11562  10983  1471.0  4152  1206
2010  11402  12873  1967.0  3870   705
2011  13055  10709  1774.0  3955  1445
2012  13747   7157  1967.0  4537  1150
2013  11373   7656  1967.0  4092  1237
2014  11429   8115  1967.0  4458  1417
2015  10357   7720  2311.0  3953  1480
2016  11583   7854  2336.0  3543  1425
2017  11668   6502  2425.0  3188  1097